# TimeInterval Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SunAndShadowSettings..::..TimeInterval Property
SunAndShadowSettings Class See Also
---
Identifies the time interval between animation frames.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public SunStudyTimeInterval TimeInterval { get; set; }
```

Visual Basic
---
```text
Public Property TimeInterval As SunStudyTimeInterval
	Get
	Set
```

Visual C++
---
```text
public:
property SunStudyTimeInterval TimeInterval {
	SunStudyTimeInterval get ();
	void set (SunStudyTimeInterval value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: the time interval value interval is not valid for the current SunAndShadowType. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace